Revit 2027 API
SpecTypeId.Period Property
 Period, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Period { get; }
Public Shared ReadOnly Property Period As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Period {
	ForgeTypeId^ get ();
}
static member Period : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace